test/suddenSqueezeOnPlateOnSeabed/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e4;

boundaryField
{
    seaBed
    {
		type			fixedValue;
		value       	uniform 1e4;
    }
    soilStructureInterface
    {
        type            zeroGradient;
    }
    soilDomainSides
    {
        type            zeroGradient;
    }
    soilDomainBottom
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
