test/suddenSqueezeOnPlateOnSeabed/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (1 0 0)
    (2 0 0)
    (3 0 0)
    (0 1 0)
    (1 1 0)
    (2 1 0)
    (3 1 0)
    (0 2 0)
    (1 2 0)
    (2 2 0)
    (3 2 0)
    (0 3 0)
    (1 3 0)
    (2 3 0)
    (3 3 0)

    (0 0 .4)
    (1 0 .4)
    (2 0 .4)
    (3 0 .4)
    (0 1 .4)
    (1 1 .4)
    (2 1 .4)
    (3 1 .4)
    (0 2 .4)
    (1 2 .4)
    (2 2 .4)
    (3 2 .4)
    (0 3 .4)
    (1 3 .4)
    (2 3 .4)
    (3 3 .4)
);

blocks          
(
    hex (0 1 5 4 16 17 21 20) (20 20 10) simpleGrading (1 1 .5)
    hex (1 2 6 5 17 18 22 21) (20 20 10) simpleGrading (1 1 .5)
    hex (2 3 7 6 18 19 23 22) (20 20 10) simpleGrading (1 1 .5)
    hex (4 5 9 8 20 21 25 24) (20 20 10) simpleGrading (1 1 .5)
    hex (5 6 10 9 21 22 26 25) (20 20 10) simpleGrading (1 1 .5)
    hex (6 7 11 10 22 23 27 26) (20 20 10) simpleGrading (1 1 .5)
    hex (8 9 13 12 24 25 29 28) (20 20 10) simpleGrading (1 1 .5)
    hex (9 10 14 13 25 26 30 29) (20 20 10) simpleGrading (1 1 .5)
    hex (10 11 15 14 26 27 31 30) (20 20 10) simpleGrading (1 1 .5)
);

edges           
(
);

patches         
(
    wall seaBed 
    (
	(16 17 21 20)
	(17 18 22 21)
	(18 19 23 22)
	(20 21 25 24)
	(22 23 27 26)
	(24 25 29 28)
	(25 26 30 29)
	(26 27 31 30)
    )
    wall soilStructureInterface
    (
	(21 22 26 25)
    )
    wall soilDomainSides 
    (
	(0 1 17 16)
	(1 2 18 17)
	(2 3 19 18)
	(3 7 23 19)
	(7 11 27 23)
	(11 15 31 27)
	(15 14 30 31)
	(14 13 29 30)
	(13 12 28 29)
	(12 8 24 28)
	(8 4 20 24)
	(4 0 16 20)	
    )
    wall soilDomainBottom
    (
	(0 4 5 1)
	(1 5 6 2)
	(2 6 7 3)
	(4 8 9 5)
	(5 9 10 6)
	(6 10 11 7)
	(8 12 13 9)
	(9 13 14 10)
	(10 14 15 11)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
